In [1]:
import pandas as pd
import numpy as np
path="Resources/US_Data.csv"
coarse_data=pd.read_csv(path)

In [3]:
coarse_data.head()

   Unnamed: 0      FOD1P  SCHL      WAGP  AGEP  COW
0     2630289     6107.0  21.0   90000.0    29  1.0
1     3217281     1903.0  21.0   39600.0    43  1.0
2     2591722  No_Degree   1.0       NaN     3  NaN
3      362858     6200.0  21.0  175000.0    52  1.0
4     3342389  No_Degree  16.0   35000.0    22  1.0

In [4]:
coarse_data.shape

(1000000, 6)

In [6]:
coarse_data['FOD1P'].fillna("No_Degree", inplace = True)
coarse_data.head()

   Unnamed: 0      FOD1P  SCHL      WAGP  AGEP  COW
0     2630289     6107.0  21.0   90000.0    29  1.0
1     3217281     1903.0  21.0   39600.0    43  1.0
2     2591722  No_Degree   1.0       NaN     3  NaN
3      362858     6200.0  21.0  175000.0    52  1.0
4     3342389  No_Degree  16.0   35000.0    22  1.0

In [7]:
bachelors_tuition = 24116
masters_tuition = 35000
phd_tuition = 0
coarse_data["tuition"] = np.where(coarse_data.SCHL == 21.0, bachelors_tuition,
                                 np.where(coarse_data.SCHL == 22.0, masters_tuition,
                                          np.where(coarse_data.SCHL == 24.0, phd_tuition, "NA")))
coarse_data.head()

   Unnamed: 0      FOD1P  SCHL      WAGP  AGEP  COW tuition
0     2630289     6107.0  21.0   90000.0    29  1.0   24116
1     3217281     1903.0  21.0   39600.0    43  1.0   24116
2     2591722  No_Degree   1.0       NaN     3  NaN      NA
3      362858     6200.0  21.0  175000.0    52  1.0   24116
4     3342389  No_Degree  16.0   35000.0    22  1.0      NA

In [9]:
coarse_data.to_csv("test.csv")